Revit 2024 API
RoofBase.GetSlabShapeEditor Method
 Gets a SlabShapeEditor that can used to add or modify points of this RoofBase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SlabShapeEditor GetSlabShapeEditor()
Visual Basic
Public Function GetSlabShapeEditor As SlabShapeEditor
Visual C++
public:
SlabShapeEditor^ GetSlabShapeEditor()
Return Value
 The SlabShapeEditor object
See Also
RoofBase Class
Autodesk.Revit.DB Namespace